<a href="https://colab.research.google.com/github/KALPA2345/multiple_regression/blob/master/Untitled1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
import numpy as np
from sklearn import linear_model

In [19]:
df= pd.read_csv('m_regress.csv')
df

   experience  test_scoore  interview_score  salary
0           0          8.0                9   50000
1           0          8.0                6   45000
2           5          6.0                7   60000
3           2         10.0               10   65000
4           7          9.0                6   70000
5           3          7.0               10   62000
6          10          NaN                7   72000
7          11          7.0                8   80000

In [20]:
import math
mean_testscore=math.floor(df.test_scoore.mean())
mean_testscore

7

In [21]:
df.test_scoore=df.test_scoore.fillna(mean_testscore)
df

   experience  test_scoore  interview_score  salary
0           0          8.0                9   50000
1           0          8.0                6   45000
2           5          6.0                7   60000
3           2         10.0               10   65000
4           7          9.0                6   70000
5           3          7.0               10   62000
6          10          7.0                7   72000
7          11          7.0                8   80000

In [22]:
reg=linear_model.LinearRegression()
reg.fit(df[['experience','test_scoore','interview_score']],df.salary)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [25]:
reg.intercept_

14992.651446693148

In [26]:
reg.coef_

array([2922.26901502, 2221.30909959, 2147.48256637])

In [28]:
reg.predict([[2,9,6]])

array([53713.86677124])